Tekla.Structures.Model.Internal.dotAssertEvent_t
The assert event.

Tekla.Structures.Model.Internal.dotAssertEvent_t.EventName
Gets or sets the name of the event.

Tekla.Structures.Model.Internal.dotAssertEvent_t.EventMessage
Gets or sets the message of the event.

Tekla.Structures.Model.Internal.dotAssertEvent_t.UpTime
Gets or sets the up time of Tekla Structures until the assert happened.

Tekla.Structures.Model.Internal.dotAssertEvent_t.CallStack
Gets or sets the callstack of the assert.

Tekla.Structures.Model.Internal.dotAssertEvent_t.Modules
Gets or sets the loaded modules.

Tekla.Structures.Model.Internal.dotAssertEvent_t.LastCommand
Gets or sets the last command executed before the assert.

Tekla.Structures.Model.Internal.dotAssertEvent_t.CrashHandlers
Gets or sets the crash handlers.

Tekla.Structures.Model.Internal.dotAssertEvent_t.LastLogEntries
Gets or sets the last log entries.